calm water resistance/KVLCC2/Fr0.1377/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.097647454838997 0 -7.248463427710155)
	(16.646471182258495 0 -7.248463427710155)
	(16.646471182258495 8.24825148670466 -7.248463427710155)
	(-11.097647454838997 8.24825148670466 -7.248463427710155)
	(-11.097647454838997 0 2.9993641769835127)
	(16.646471182258495 0 2.9993641769835127)
	(16.646471182258495 8.24825148670466 2.9993641769835127)
	(-11.097647454838997 8.24825148670466 2.9993641769835127)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (111 33 41) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

