calm water resistance/KVLCC2/Fr0.1377/0.org/include/initialConditions
flowVelocity          (1.013043 0 0);
Umean                  1.013043;
turbulentKE            1.539384e-04;
turbulentOmega         9.180770e-01;
turbulentEpsilon       8.479636e-08;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;